export default function Neofetch(){
    return (
      <div className="flex flex-col sm:flex-row justify-center items-center text-sm sm:text-base">
      <span className="text-blue-400 w-full max-w-md overflow-hidden break-words text-xs sm:text-sm md:text-base">
            {`\n

                             ⣸⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡘⢿⣿⣿⣿⣿⣿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣶⣽⣿⣿⣿⣿⣿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⠿⠿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⡟⠀⠀⠀ ⠈⠻⣿⣿⣿⣿⣿⣷⡀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⢠⣾⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀ ⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀
            ⠀⠀⠀⢠⣾⣿⣿⣿⣿⣿⣿⡷⠀⠀⠀⠀⠀⠀ ⢸⣿⣿⣿⣿⣷⣽⣛⠀⠀⠀⠀
            ⠀⠀⢠⣿⣿⣿⣿⣿⣿⠿⠛⠛⠀⠀⠀⠀⠀ ⠀⠛⠛⠿⣿⣿⣿⣿⣿⣶⡄⠀⠀
            ⠀⢰⣿⣿⠿⠟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠙⠛⠿⣿⣿⡆⠀
            ⡰⠟⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⠀⠀⠉⠻⢆

            `}
            </span>
            <div className="text-green-400 font-mono text-xs sm:text-sm md:text-base">
            <p className="text-green-300">VinitGurjar@Portfolio</p>
            <p className="text-green-300">-------------------</p>
            <p>OS: i Use Arch btw</p>
            <p>Kernel: 6.5.0-arch1-1</p>
            <p>Uptime: 3 hours, 12 mins</p>
            <p>Packages: 1543 (pacman)</p>
            <p>Shell: zsh 5.9</p>
            <p>Resolution: 1920x1080</p>
            <p>WM: i3</p>
            <p>Terminal: GNOME Terminal</p>
            <p>CPU: Intel i7-12700K @ 5.0GHz</p>
            <p>GPU: NVIDIA RTX 3070</p>
            <p>Memory: 16GB DDR4</p>
            <p className="text-xs sm:text-sm md:text-base">
              ⬛🟥🟩🟫🟦🟪🟦⬛
              🟩🟥🟩🟨🟦🟪🟦⬜ 
            </p>
            </div>
        </div>
      );
}